УТ/src/Catalogs/CRM_ВариантыВиджетов/CRM_ВариантыВиджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ВариантыВиджетов</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Виджет</name>
    <type>
      <types>CatalogRef.CRM_Виджеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольнаяСумма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиВарианта</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОбновления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоДляАвтора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ/src/Catalogs/CRM_ВариантыВиджетов/Forms/ФормаЭлемента/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции модуля формы "Справочники.CRM_ВариантыВиджетов.Форма.ФормаЭлемента".
//
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("НастройкиСоздания") Тогда
		
		НастройкиСоздания = Параметры.НастройкиСоздания;
		
		Объект.Виджет = Параметры.Виджет;
		Элементы.Виджет.Доступность = Ложь;
		
	КонецЕсли;
	

	ТекущийПользователь = Пользователи.ТекущийПользователь();
	ЭтоАдминистратор = Пользователи.ЭтоПолноправныйПользователь(ТекущийПользователь, Истина);
	
	Если ЭтоАдминистратор Тогда
		Элементы.Автор.Вид = ВидПоляФормы.ПолеВвода;
	Иначе
		Если Не Объект.Ссылка.Пустая() Тогда
			ДоступенВсем = Не Объект.ТолькоДляАвтора;
			Если ДоступенВсем И Объект.Автор <> ТекущийПользователь Тогда
				ЭтотОбъект.Доступность = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Автор = ТекущийПользователь;
		Объект.Используется = Истина;
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если НастройкиСоздания <> Неопределено Тогда
		
		ТекущийОбъект.НастройкиВарианта = Новый ХранилищеЗначения(НастройкиСоздания);
		
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписьюНаСервере()

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьНастройки(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Для открытия настроек необходимо записать объект.'"));
		Возврат;
	КонецЕсли;
	
	НастройкиВарианта = CRM_РаботаСВиджетамиВызовСервера.ПолучитьНастройкиВариантаВиджета(
		Объект.Ссылка);
	
	ТипВиджета = CRM_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(
		Объект.Виджет, "ТипИсточникаДанных");
	
	ДанныеВиджета = Новый Структура;
	ДанныеВиджета.Вставить("ВариантВиджета", Объект.Ссылка);
	ДанныеВиджета.Вставить("Настройки", НастройкиВарианта);
	ДанныеВиджета.Вставить("ТипВиджета", ТипВиджета);
	
	ОписаниеОповещенияОбИзмененииНастроек = Новый ОписаниеОповещения(
		"ПриИзмененииНастроекВариантаВиджета", ЭтотОбъект);
	
	CRM_РаботаСВиджетамиКлиент.ОткрытьНастройкиВиджета(
		ЭтотОбъект, ДанныеВиджета, ОписаниеОповещенияОбИзмененииНастроек);
	
КонецПроцедуры // ОткрытьНастройки()

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Процедура ПриИзмененииНастроекВариантаВиджета(ДанныеВиджета, ДополнительныеПараметры) Экспорт
	
	Прочитать();
	
КонецПроцедуры // ПриИзмененииНастроекВариантаВиджета()

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
